% =============================
% 倒立振子simulation
% LQ control
% ============================
clear,clc,close all

%% パラメータ
global g Mb Mw Rw L Jb Jm Jw Kt Kb Rm Gr

 g= 9.81;
 Mb=0.302;
 Mw=0.038;
 Rw=0.04;
 L=0.015;
 


%  Jb=0.000229712;
%  Jm=2*0.00000002;
%  Jw=2*0.000023;
%  Kt=0.0426;
%  Kb=0.08814; 
%  Rm=4;
%  Gr=1;

 Jb=0.000229712;
 Jm=2*0.00000002;
 Jw=2*0.000023;
 Kt= 0.003382287;
 Kb=0.003067344; 
%  Rm=Gr*Kt*Kb/0.000472285 +0.280;
 Rm=4;
 Gr=110;
 
 
 
 x1=0.0;
 x2=0.05; 
 x3=0.0;
 x4=0.0;
 
 
 x=[x1; x2; x3; x4];
 
%%


mat2 % 行列

euler % 積分計算

plot2 % プロット

